/**
  ********************************  STM32F10x  *********************************
  *********************************  uC/OS-II  *********************************
  * @文件名     ： app_task.h
  * @作者       ： strongerHuang
  * @库版本     ： V3.5.0
  * @系统版本   ： V2.92
  * @文件版本   ： V1.0.0
  * @日期       ： 2016年06月28日
  * @摘要       ： 应用程序任务的头文件
  ******************************************************************************/

/* 定义防止递归包含 ----------------------------------------------------------*/
#ifndef _APP_TASK_H
#define _APP_TASK_H

/* 包含的头文件 --------------------------------------------------------------*/
#include "ucos_ii.h"


/* 函数申明 ------------------------------------------------------------------*/
void AppTask1(void *p_arg);
void AppTask2(void *p_arg);
void AppTask3(void *p_arg);


#endif /* _APP_TASK_H */

/**** Copyright (C)2016 strongerHuang. All Rights Reserved **** END OF FILE ****/
